artilleryTests/rosetta-load-test.yml
config:
  target: http://127.0.0.1:8082
  ensure:
    thresholds:
      - vusers.failed: 1
  http:
    timeout: 120
    defaults:
      headers:
        Content-Type: application/json
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: { }
    expect:
      expectDefault200: true
      outputFormat: silent
      reportFailuresAsErrors: true
    metrics-by-endpoint:
      useOnlyRequestNames: true
      metricsNamespace: "latency_metrics"
scenarios:
  - flow:
      - post:
          url: '/network/status'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "metadata": {}
            }
      - post:
          url: '/account/balance'
          body: |
            {
                "network_identifier": {
                    "blockchain": "cardano",
                    "network": "preprod"
                },
                "account_identifier": {
                    "address": "addr_test1qz5t8wq55e09usmh07ymxry8atzwxwt2nwwzfngg6esffxvw2pfap6uqmkj3n6zmlrsgz397md2gt7yqs5p255uygaesx608y5"
                }
            }
      - post:
          url: '/block'
          body: |
              {
                  "network_identifier": {
                      "blockchain": "cardano",
                      "network": "preprod"
                  },
                  "block_identifier": {
                      "index": 20
                  }
              }
      - post:
          url: '/construction/parse'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "signed": false,
              "transaction": "82790132613530303831383235383230326632336664386363613833356166323166336163333735626163363031663937656164373566326537393134336264663731666532633462653034336538663031303138323832353831643631626234306631613634376263383863316264366237333864623865623636333537643932363437346561356666643662616137366339666230313832353831643631626234306631613634376263383863316264366237333864623865623636333537643932363437346561356666643662616137366339666230343032316130353762636566623033313930336538303438313832303138323030353831636262343066316136343762633838633162643662373338646238656236363335376439323634373465613566666436626161373663396662a16a6f7065726174696f6e7382a6746f7065726174696f6e5f6964656e746966696572a265696e646578006d6e6574776f726b5f696e64657800647479706565696e707574667374617475736773756363657373676163636f756e74a16761646472657373783a616464723176786135707564786737376733736461646465636d773874766336686d796e79776e34396c6c747434666d766e3763706e6b63707866616d6f756e74a26576616c7565692d39303030303030306863757272656e6379a26673796d626f6c6341444168646563696d616c73066b636f696e5f6368616e6765a26f636f696e5f6964656e746966696572a16a6964656e7469666965727842326632336664386363613833356166323166336163333735626163363031663937656164373566326537393134336264663731666532633462653034336538663a316b636f696e5f616374696f6e6a636f696e5f7370656e74a5746f7065726174696f6e5f6964656e746966696572a165696e646578036474797065767374616b654b65794465726567697374726174696f6e667374617475736773756363657373676163636f756e74a16761646472657373783b7374616b653175387a666e6b687034673676686e6565746d763271656e3766356e64726b6c716a7138653973326e636b3968333063667a36716d70686d65746164617461a2727374616b696e675f63726564656e7469616ca2696865785f62797465737840314234303044363041414633344541463644434241423942424134363030314132333439373838364346313130363646373834363933334433304535414433466a63757276655f747970656c6564776172647332353531396c726566756e64416d6f756e74a26576616c7565682d323030303030306863757272656e6379a26673796d626f6c6341444168646563696d616c7306"
            }
      - post:
          url: '/construction/combine'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "unsigned_transaction": "8278ee61343030383138323538323032663233666438636361383335616632316633616333373562616336303166393765616437356632653739313433626466373166653263346265303433653866303130313832383235383164363162623430663161363437626338386331626436623733386462386562363633353764393236343734656135666664366261613736633966623139323731303832353831643631626234306631613634376263383863316264366237333864623865623636333537643932363437346561356666643662616137366339666231393963343030323139396334303033313930336538a16a6f7065726174696f6e7381a6746f7065726174696f6e5f6964656e746966696572a265696e646578006d6e6574776f726b5f696e64657800647479706565696e707574667374617475736773756363657373676163636f756e74a16761646472657373783b416532746450775550455a4336574a66565178544e4e3274577734736b47724e367a5256756b76784a6d544679316e596b5647514275555255334c66616d6f756e74a26576616c7565662d39303030306863757272656e6379a26673796d626f6c6341444168646563696d616c73066b636f696e5f6368616e6765a26f636f696e5f6964656e746966696572a16a6964656e7469666965727842326632336664386363613833356166323166336163333735626163363031663937656164373566326537393134336264663731666532633462653034336538663a316b636f696e5f616374696f6e6a636f696e5f7370656e74",
              "signatures": [
                {
                  "signing_payload": {
                    "account_identifier": {
                      "address": "Ae2tdPwUPEZC6WJfVQxTNN2tWw4skGrN6zRVukvxJmTFy1nYkVGQBuURU3L",
                      "metadata": {
                        "chain_code": "dd75e154da417becec55cdd249327454138f082110297d5e87ab25e15fad150f"
                      }
                    },
                    "hex_bytes": "4691ebf945f37962153f74e198ba2553177e6dc8e464303e37589077f634397c",
                    "signature_type": "ed25519"
                  },
                  "public_key": {
                    "hex_bytes": "73fea80d424276ad0978d4fe5310e8bc2d485f5f6bb3bf87612989f112ad5a7d",
                    "curve_type": "edwards25519"
                  },
                  "signature_type": "ed25519",
                  "hex_bytes": "dc2a1948bfa9411b37e8d280b04c48a85af5588bcf509c0fca798f7b462ebca92d6733dacc1f1c6c1463623c085401be07ea422ad4f1c543375e7d3d2393aa0b"
                }
              ]
            }
      - post:
          url: '/construction/payloads'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "operations": [
                {
                  "operation_identifier": {
                    "index": 0,
                    "network_index": 0
                  },
                  "type": "input",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "-90000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  },
                  "coin_change": {
                    "coin_identifier": {
                      "identifier": "2f23fd8cca835af21f3ac375bac601f97ead75f2e79143bdf71fe2c4be043e8f:1"
                    },
                    "coin_action": "coin_spent"
                  }
                },
                {
                  "operation_identifier": {
                    "index": 1
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "10000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 2
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "40000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 3
                  },
                  "type": "stakeKeyDeregistration",
                  "status": "success",
                  "account": {
                    "address": "stake1uxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7caek7a5"
                  },
                  "metadata": {
                    "staking_credential": {
                      "hex_bytes": "1B400D60AAF34EAF6DCBAB9BBA46001A23497886CF11066F7846933D30E5AD3F",
                      "curve_type": "edwards25519"
                    }
                  }
                }
              ],
              "metadata": {
                "ttl": "0",
                "protocol_parameters": {
                  "coinsPerUtxoSize": "0",
                  "maxTxSize": 16384,
                  "maxValSize": 0,
                  "keyDeposit": "2000000",
                  "maxCollateralInputs": 0,
                  "minFeeCoefficient": 44,
                  "minFeeConstant": 155381,
                  "minPoolCost": "340000000",
                  "poolDeposit": "500000000",
                  "protocol": 4
                }
              }
            }
      - post:
          url: '/construction/preprocess'
          body: |
            {
              "metadata": {
                "deposit_parameters": {
                  "poolDeposit": "500000000",
                  "keyDeposit": "2000000"
                }
              },
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "operations": [
                {
                  "operation_identifier": {
                    "index": 0,
                    "network_index": 0
                  },
                  "type": "input",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "-90000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  },
                  "coin_change": {
                    "coin_identifier": {
                      "identifier": "2f23fd8cca835af21f3ac375bac601f97ead75f2e79143bdf71fe2c4be043e8f:1"
                    },
                    "coin_action": "coin_spent"
                  }
                },
                {
                  "operation_identifier": {
                    "index": 1
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "10000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                },
                {
                  "operation_identifier": {
                    "index": 2
                  },
                  "related_operations": [
                    {
                      "index": 0
                    }
                  ],
                  "type": "output",
                  "status": "success",
                  "account": {
                    "address": "addr1vxa5pudxg77g3sdaddecmw8tvc6hmynywn49lltt4fmvn7cpnkcpx"
                  },
                  "amount": {
                    "value": "40000",
                    "currency": {
                      "symbol": "ADA",
                      "decimals": 6
                    }
                  }
                }
              ]
            }
      - post:
          url: '/construction/metadata'
          body: |
            {
                "network_identifier": {
                    "blockchain": "cardano",
                    "network": "preprod"
                },
                "options": {
                    "transaction_size": 40.0,
                    "relative_ttl": 10.0
                }
            }
      - post:
          url: '/construction/hash'
          body: |
            {
              "network_identifier": {
                "blockchain": "cardano",
                "network": "preprod"
              },
              "signed_transaction": "827901c43834613430303831383235383230326632336664386363613833356166323166336163333735626163363031663937656164373566326537393134336264663731666532633462653034336538663031303138323832353831643631626234306631613634376263383863316264366237333864623865623636333537643932363437346561356666643662616137366339666231393237313038323538316436316262343066316136343762633838633162643662373338646238656236363335376439323634373465613566666436626161373663396662313939633430303231393963343030333139303365386131303038313832353832303162343030643630616166333465616636646362616239626261343630303161323334393738383663663131303636663738343639333364333065356164336635383430366339323530383133356362303630313837613237303661646538313534373832383637623135323665393631356430363734326265356335366630333761623835383934633039386332616230373937313133336330343737626165653932616466333532376164376363383136663133653165346333363130343132303666356636a16a6f7065726174696f6e7381a6746f7065726174696f6e5f6964656e746966696572a265696e646578006d6e6574776f726b5f696e64657800647479706565696e707574667374617475736773756363657373676163636f756e74a16761646472657373783a616464723176786135707564786737376733736461646465636d773874766336686d796e79776e34396c6c747434666d766e3763706e6b63707866616d6f756e74a26576616c7565662d39303030306863757272656e6379a26673796d626f6c6341444168646563696d616c73066b636f696e5f6368616e6765a26f636f696e5f6964656e746966696572a16a6964656e7469666965727842326632336664386363613833356166323166336163333735626163363031663937656164373566326537393134336264663731666532633462653034336538663a316b636f696e5f616374696f6e6a636f696e5f7370656e74"
            }
      - post:
          url: '/construction/derive'
          body: |
            {
                "network_identifier": {
                    "blockchain": "cardano",
                    "network": "preprod"
                },
                "public_key": {
                    "hex_bytes": "d498c3d54941e01cbcfb565371a844f1342edee82795ef5297de45be3acb19d8",
                    "curve_type": "edwards25519"
                },
                "metadata": {
                    "address_type": "Base",
                    "staking_credential": {
                      "hex_bytes": "43d39a2ac216e5468d4f19541c204df47a7721c4f3b0b40dc6d290e53cb45ffe",
                      "curve_type": "edwards25519"
                    }
                }
            }